
    // <!-- 1.Створити розмітку з формою, що містить список (select) з трьома варіантами вибору:
    //  "Кава", "Чай" та "Сік". При виборі кожного варіанту виводити відповідне повідомлення в блок на сторінці. -->

let result = "Чай";
// звідси би приходила відповідь

    switch (result) {
  case "Кава": alert("Ви вибрали каву.");break;
  case "Чай": alert("Ви вибрали чай.");break;
  case "Сік": alert("Ви вибрали сік.");break;
    default: alert("Дія не передбачена");break;
}
     
// <!-- 2.Створити розмітку з полем введення, що приймає рядок та кнопкою.
//  При натисканні на кнопку перевіряти, чи введений рядок є днем тижня (наприклад: "понеділок", "вівторок" і т.д.),
//   виводити відповідне повідомлення про робочий день або вихідний. -->
result = "неділя";

switch (result) {
  case "понеділок": alert("Сьогодні понеділок.");break;
  case "вівторок": alert("Сьогодні вівторок.");break;
  case "середа": alert("Сьогодні середа.");break;
  case "четвер": alert("Сьогодні четвер.");break;
  case "п'ятниця": alert("Сьогодні п'ятниця.");break;
  case "суббота": alert("Сьогодні суббота.");break;
  case "неділя": alert("Сьогодні неділя.");break;
    default: alert("Дія не передбачена");break;
}

//  <!-- 3.Створити розмітку з полем введення, що приймає номер місяця та кнопкою.
//  При натисканні на кнопку виводити повідомлення про пору року, до якої належить цей місяць. -->

result = "лютий";

switch (result) {
  case "грудень":
  case "січень":
  case "лютий": alert("Зараз " + selectedOption + ", зима.");break;
  // можна далі копіювати, теж саме буде. вийшло так що тут і пору можна відслідкувати, і місяць.
    default: alert("Дія не передбачена");break;
}

// <!-- 4.Створити розмітку з полем введення, що приймає номер місяця та кнопкою.
//  При натисканні на кнопку виводити кількість днів у цьому місяці. -->

result = 4;

switch (result) {
  case 1:
    case 3:
      case 5:
        case 7:
      case 8:
          case 10:
            case 12: alert("31 Днів");break;
  case 4:
    case 6:
        case 9:
          case 11: alert("30 Днів");break;
  case 2: alert("28 Днів");break;
    default: alert("Дія не передбачена");break;
}

// <!-- 5.Створити розмітку з полем введення, що приймає назву кольору (наприклад, "червоний", "синій" і т.д.) та кнопкою.
//  При натисканні на кнопку виводити відповідне повідомлення про дію: якщо це "червоний" — "стоп",
//   якщо "зелений" — "йти", якщо "жовтий" — "чекати". -->

result = "зелений";
// кнопка повинна зберігати колір до цього лету


switch (result) {
  case "червоний": alert("стоп");break;
  case "зелений": alert("йди");break;
  case "жовтий": alert("чекати");break;
    default: alert("Дія не передбачена");break;
}

// <!-- 6.Створити розмітку з двома полями введення, що приймають числа та список (select)
//  з варіантами вибору операцій: "+", "-", "*", "/".
//   При натисканні на кнопку виводити результат обраної операції над цими числами.
//    Користувач повинен бути попереджений про можливість ділення на нуль. -->

result = "-";

let operation;

let firstNumber = 3;
let secondNumber = 7;
// сюди би поставляли данні

switch (result) {
  case "+":  operation = firstNumber + secondNumber;
  alert(operation);break;

  case "-":  operation = firstNumber - secondNumber;
  alert(operation);break;

  case "/":  if (secondNumber !== 0) {
    operation = firstNumber / secondNumber;
    alert(operation);} else {
    alert("Ділити на нуль заборонено!");
  };break;

  case "*":  operation = firstNumber * secondNumber;
  alert(operation);break;

    default: alert("Дія не передбачена");break;
}