"use strict"

// 1.Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
for (let i = 0; i < 11; i += 1) {
    console.log(i);
}

// 2.Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.
//  Якщо число не парне, пропустити його за допомогою continue.
for (let i = 1; i < 21; i += 1) {
    if (i%2 === 0) {console.log(i);} else {continue}
}

// 3.Вивести на екран таблицю множення числа 7 за допомогою циклу for.
for (let i = 7; i <= 63; i + 7) {
    console.log(i)
}

// 4.Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.
// я міг би це зробити, звичайно, але ми цього не проходили тому я відчуваю що це завдання на майбутнє P.S. зараз ми проходимо массиви, тому, я створю окрему гілку з массивами теж P.P.S. можете глянути на версію без них

const numLessArray = [1, 2, 3, 4, 5];
for (let i = 0; i < numLessArray.length; i += 1) {
    console.log(numLessArray[i])
}

// 5.Створити масив із числами від 1 до 10.
//  За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7.
//   Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.
const numArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let i = 0; i < numArray.length; i += 1) {
    if (i !== 7) {console.log(numArray[i])} else {break}
}

// 6.Створити скрипт, який виводить на екран всі числа, які менші за n.
//  Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
let n = 15;
for (let i = 0; i < 8888; i += 1.55) {
    if (i < n) {console.log(i)} else {break}
}

// 7.За допомогою циклу while вивести на екран всі числа від 1 до 20,
//  крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання
//   за допомогою оператора continue.

for (let i = 1; i <21; i += 1) {
    if (i%3 !== 0) {console.log(i)} else {continue}
}
